[
  {
    "title": "Data Scientist, Consumer Research & Marketing",
    "company": "Handshake",
    "description": "Everyone is welcome at Handshake. We know diverse teams build better products and we are committed to creating an inclusive culture built on a foundation of respect for all individuals. We strongly encourage candidates from non-traditional backgrounds, historically marginalized or underrepresented groups to apply.\n\nYour impact\n\nIn this crucial role, you will be a strategic partner and advisor to our Consumer Growth and PLG/Lifecycle Marketing teams. You will drive user growth by translating performance of our marketing campaigns, channels, and tactics into actionable insights that ensure efficient scaling and accelerated business results. You will also enable marketers to self-service by delivering well-designed dashboards and reports. In addition, you will also partner with cross-functional teams to identify trends and insights across our consumer acquisition, engagement, and retention funnel.\n\nThe right candidate is intellectually curious, highly collaborative, and loves telling stories backed by data. Your experience with reporting tools and attention to detail will be invaluable as you manage end-to-end analytical projects in our fast-paced environment. You’ll play a meaningful role in providing insightful analyses and strategic recommendations on how Handshake can deliver sustainable growth in acquiring new users and improved marketing campaign and channel performance. You are a strategic thinker with a bias toward action, and are able to drive alignment across senior leadership. You lead with empathy and advocate internally on behalf of Handshake customers and the Marketing team.\n\nYour role\n\n• Support our consumer and PLG growth initiatives to improve funnel performance (conversion rates, sales cycle, etc.), ensuring we have compelling insights readily available based campaign, lead, and pipeline performance\n• Work as a collaborative teammate across Product, Data Engineering, and Marketing teams to support and drive marketing’s data strategy, operational processes and reporting\n• Write complex SQL queries and perform in-depth analyses to extract meaningful patterns and opportunities from our consumer data\n• Be project lead for creating new data pipelines and tables in BigQuery and DBT\n• Communicate data-driven strategic insights on user acquisition, engagement, and retention to senior leadership team\n• Assist and lead the development of new reporting and dashboards to analyze our marketing impact and effectiveness\n• Partner closely with the Data Engineering team to uphold metric integrity, ensuring KPIs are accurately contextualized and pulled from “source of truth”\n• Partner with Marketing Ops to build scalable intake processes, communicate a schedule of upcoming analyses and deliver regular training and enablement materials to the greater team\n\nYour Experience\n\n• 5-6+ years of experience in marketing analytics, consumer insights, growth analytics, or a related role. \n• Background working in B2C, SaaS, or tech startups with exposure to PLG and lifecycle marketing.\n• Expert in SQL and business intelligence/data visualization tools (e.g., Tableau, Power BI, Mode, or similar). We use Looker and Hex for scalable dashboards and exploratory analysis. \n• Experience building new data pipelines and tables in BigQuery and DBT.\n• Understanding of digital marketing performance metrics (CAC, LTV, conversion rates, etc.)\n• Experience analyzing marketing campaigns across multiple channels (email, paid media, SEO, social media).\n• Familiarity with customer segmentation strategies and cohort analysis.\n• Strategic, structured thinker with strong analytical skills and business acumen.\n• Effective, clear, and executive level communication skills, verbal and written.\n• Authentic and demonstrated ability to drive cross-functional projects end-to-end and strong project management skills.\n\nCompensation Range\n\n• $156,000 - $180,000 + RSUs\n\nFor cash compensation, we set standard ranges for all U.S.-based roles based on function, level, and geographic location, benchmarked against similar stage growth companies. In order to be compliant with local legislation, as well as to provide greater transparency to candidates, we share salary ranges on all job postings regardless of desired hiring location. Final offer amounts are determined by multiple factors, including geographic location as well as candidate experience and expertise, and may vary from the amounts listed above.\n\nAbout Us\n\nHandshake is the career platform for Gen Z. With a community of over 17 million students, alumni, employers, and career educators, Handshake’s network is where career advice and discovery turn into first, second, and third jobs. Nearly 1 million companies use Handshake to build their future workforce—from Fortune 500 to federal agencies, school districts to startups, healthcare systems to small businesses. Handshake is built for where you’re going, not where you’ve been.\n\nWhen it comes to our workforce strategy, we’ve thought deeply about how work-life should look at Handshake. With our hybrid-work model, employees benefit from collaboration and shared team experiences three days per week in our vibrant offices, and enjoy the flexibility of remote work two days per week (unless noted in the specific job posting). Handshake is headquartered in San Francisco, with offices in New York, London, and Berlin.\n\nWhat we offer\n\nAt Handshake, we'll give you the tools to feel healthy, happy and secure.\n\nBenefits below apply to employees in full-time (not Contract) positions.\n\n• 💰 Equity and ownership in a fast-growing company.\n• 🍼 16 Weeks of paid parental leave for birth giving parents &amp; 10 weeks of paid parental leave for non-birth giving parents.\n• 💝 Comprehensive medical, dental, and vision policies including LGTBQ+ Coverage. We also provide resources for Mental Health Assistance, Employee Assistance Programs and counseling support.\n• 💻 Handshake offers $500/£360 home office stipend for you to spend during your first 3 months to create a productive and comfortable workspace at home.\n• 📚 Generous learning &amp; development opportunities and an annual $2,000/£1,500/€1,850 stipend for you to grow your skills and career.\n• 💰 Financial coaching through Origin to help you through your financial journey.\n• 🛜 Monthly internet stipend and a brand new MacBook to allow you to do your best work.\n• 🚃 Monthly commuter stipend for you to expense your travel to the office (for office-based employees).\n• 🥗 Free lunch provided 3x a week across all offices.\n• 🤝 Referral bonus to reward you when you bring great talent to Handshake.\n\n(US-specific Benefits, In Addition To The First Section)\n\n• 🏦 401k Match: Handshake offers a dollar-for-dollar match on 1% of deferred salary, up to a maximum of $1,200 per year.\n• 🏝 All full-time US-based Handshakers are eligible for our flexible time off policy to get out and see the world. In addition, we offer 13 standardized holidays, and 2 additional days of flexible holiday time off. Lastly, we have a Winter #ShakeBreak, a one-week period of Collective Time Off.\n• 🍼 Family support: Parental leave coaching and support provided by Parentaly. We partner with Maven Clinic to provide a lifetime coverage up to $15K for expenses related to fertility and family forming!\n• 💰 Lifestyle Savings Account: We offer you an annual stipend of $500 to use for purchases such as fitness classes, gym memberships, work-from-home setup, and more.\n\n(UK-specific Benefits, In Addition To The First Section)\n\n• 🏦 Pension Scheme: Handshake will provide you with a workplace pension, where you will make contributions based on 5% of your salary. Handshake will pay the equivalent of 3% towards your pension plan, subject to qualifying earnings limits.\n• 🏝 Up to 25 days of vacation to encourage people to reset, recharge, and refresh, in addition to 8 bank holidays throughout the year.\n• 🤝 Regular offsites each year to bring the team together + opportunity to travel to our HQ in San Francisco.\n• 🛍️ Discounts across various high street retailers, cinemas and other social activities exclusively for Handshake UK employees.\n\n(Germany-specific Benefits, In Addition To The First Section)\n\n• 🏝 25 days of annual leave + 5 days of a winter #ShakeBreak, a one-week period of Collective Time Off across the company.\n• 🤝 Regular offsites each year to bring the team together + opportunity to travel to our HQ in San Francisco once a year.\n• 🧘 Urban sports club membership offering access to a diverse network of fitness and wellness facilities.\n• 🛍️ Discounts across various high street retailers, cinemas and other social activities exclusively for Handshake Germany employees.\n\nLooking for more? Explore our mission, values and comprehensive US benefits at joinhandshake.com/careers.\n\nHandshake is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or reasonable accommodation, please let your recruiter know during initial communications.",
    "location": "San Francisco, CA",
    "date_posted": "2025-03-23"
  },
  {
    "title": "Growth Data Scientist/ Analyst",
    "company": "Crypto.com",
    "description": "We are seeking a dynamic Growth Data Scientist/Analyst to join our Growth team. The successful candidate will be instrumental in leveraging data to drive strategic decisions, optimize growth initiatives, and enhance user acquisition strategies.\n\nResponsibilities\n• Develop and maintain acquisition and engagement (e.g. influencer/affiliate, organic, VIP, , paid acquisition etc.) dashboards to monitor user growth and campaign effectiveness\n• Assist in building predictive models to guide strategic decisions on acquisition and engagement, encompassing time series, predictive analytics, and recommender systems\n• Analyze data to derive actionable insights that drive business decisions and performance improvements\n• Automate repetitive tasks and data processes to enhance team efficiency\n• Collaborate with cross-functional teams to support data-driven decisions and project implementations\n• Engage in continuous learning to stay ahead of industry trends and leverage new tools and techniques in data analysis\n\nRequirements\n• Bachelor’s degree in a quantitative field such as Statistics, Computer Science, Engineering, or related fields\n• Up to 3 years of experience in data analysis or a related field. Experience in the crypto industry is a plus\n• Familiarity with User Acquisition (UA) and/or Customer Relationship Management (CRM) concepts is advantageous\n• Proficiency in SQL and familiarity with data visualization tools like Tableau\n• Experience with statistical software (e.g., R, Python) and libraries for managing, manipulating, and analyzing data\n• Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy\n• Adept at queries, report writing, and presenting findings\n• Knowledge of acquisition campaign platforms and tools such as Appsflyer, SensorTower, or similar platforms\n• Excellent verbal and written communication skills",
    "location": "United States",
    "date_posted": "Recently posted"
  },
  {
    "title": "Data Scientists",
    "company": "Lucayan Technology Solutions LLC",
    "description": "Location: III Corps at Fort Cavazos, Texas\n\nEmployment Type: Full Time\n\nCompany Overview\n\nLucayan Technology LLC is currently seeking Data Scientists to support III Corps at Fort Cavazos, Texas. This is an opportunity to make a significant contribution in a meaningful and impactful way, supporting the well-being of service members and their families.\n\nAs a Data Scientists, you will formulate and lead guided, multifaceted analytic studies against large volumes of data. Develop AI/ML models to enrich data providing further utility to the analysts. Conducts complex data assessments to determine operational utility of proposed data sets in answering priority intelligence requirements. Develop and maintain data pipelines to ingest applicable data into AI/ML engines and tools. Discovers links and connections in disparate datasets providing context to intelligence analysts.\n\nJob Duties Include (but not limited to):\n\n• Interpret and analyze data using exploratory mathematic and statistical techniques based on the scientific method\n• Experiment against data points, provide information based on experiment results and provide previously undiscovered solutions to command data challenges\n• Coordinate with Data Engineers to build Data environments providing data identified by Data Analysts, Data Integrators, Knowledge Managers, and Intel Analysts\n• Coordinate research and analytic activities utilizing various data points (unstructured and structured) and employ programming to clean, massage, and organize the data\n• Develop and deploy AI/ML models to enrich SOCOM data holding in support of priority intelligence requirements\n• Create advanced analytic models leverage multi-modal datasets to answer complex intelligence\n• Lead all data experiments tasked by the IDST\n\nRequired Skills &amp; Experience:\n\n• Python, R, Natural Language Processing (NLP), AI/ML Ops\n• Can write in modern coding languages; Python &amp; JavaScript required; Experience with Flask and React preferred\n• Can read and understand other coding languages; HTML/CSS, R, Java, C, C++, C#\n• Create respective process documentation using a web-based version control\n• Experience with Gitlab and Jira\n• Provide written and verbal communication and respective business process\n• Work independently and on teams and have excellent time management and work prioritization skills\n• Execute complex projects within government defined timelines across a geographically dispersed workforce and user base\n• Demonstrated experience applying data science methods to real-world data problems\n• Demonstrated experience developing and deploying AI/ML in support of decision making\n\nDesired Skills\n\n• SQL, NoSQL, SQL Alchemy, Flask, Streamlit, Dash, React, JavaScript, HTML/CSS, Spark, Application Programming Interfaces, Continuous Integration / Continuous Development (CI/CD)\n\nEducation &amp; Certifications:\n\n• Master’s degree or Bachelor’s degree in Data Science, Applied Mathematics, Statistics, Physics, Computer Science, or related fields\n\nWhy Join Lucayan Technology LLC?\n\n• Support critical Department of Defense operations\n• Work in a secure, mission-focused environment\n• Opportunities for professional development and advancement\n\nApply today to be part of a highly skilled team supporting national security efforts!\n\nPowered by JazzHR\n\naRFIxwFrub",
    "location": "Fort McKavett, TX",
    "date_posted": "2025-04-02"
  },
  {
    "title": "Decision Scientist",
    "company": "Fractal",
    "description": "Senior Decision Scientist\n\nFractal Analytics is a strategic AI partner to Fortune 500 companies with a vision to power every human decision in the enterprise. Fractal is building a world where individual choices, freedom, and diversity are the greatest assets. An ecosystem where human imagination is at the heart of every decision. Where no possibility is written off, only challenged to get better. We believe that a true Fractalite is one who empowers imagination with intelligence. And that it will be such Fractalites that will continue to build the company for the next 100 years.\n\nRole Overview:\nWe are seeking a Senior Decision Scientist to play a vital role in providing best in class analytics delivery services. In this role, you will have hands on involvement in project management, business interpretation, application of solutions, client communication and insights/results delivery within the product sales and analytics space. \n\nSuccessful candidates must have strong expertise in Tableau and SQL and will utilize a combination of data engineering, analytics, dashboarding, presentation development, and storytelling to generate actionable insights to help improve the customer experience across digital journeys. As the solution owner of the project(s), you will serve as the single point of contact for cross-functional teams and be responsible for successful project delivery. Additionally, you will collaborate with your team and peers to develop resourcing plans, manage revenue goals, and contribute to new business development.\n\nKey Responsibilities:\n\nProject Delivery:\n\n• Being hands-on and Lead analytics delivery, guiding the team in data synthesis, modeling techniques, deriving actionable insights and helping them apply analytical techniques and frameworks.\n• Measure client impact using metrics like NPS, innovative solutions, and KPI improvements.\n• Make sure that all project deliverables are completed on schedule and in accordance with client’s needs and expectations; and meet all compliance and regulatory requirements.\n• Monitor project progress and handle any issues that arise.\n• Ensure projects are delivered on time, within scope, and within budget.\n\nTalent Management:\n\n• Lead a motivated team, encouraging capability development through learning and knowledge sharing.\n• Attract, retain, and develop high-caliber talent.\n\nClient Engagement:\n\n• Service Quality Assurance\n• Communication and Reporting\n• Support Client Relationship Management\n\nCollaboration:\n\n• Work with sales, marketing, capability teams, and enabling functions to deliver higher value to clients.\n• Participate in the sales process to scope client needs and develop solution approaches.\n\nThought Leadership:\n\n• Contribute to practice development through thought leadership and scalable solutions for business problems.\n\nOperations Management:\n\n• All aspects of client facing Project Management – Project Planning and Scheduling, Staffing Management, Risk Management, Quality Management, Communication Management, Performance Management, Project Closure\n• All aspects of internal Fractal processes related to Project Management – Project Configuration and Management, Revenue Cycle Management Stakeholder Management:\n• Communicate, influence, and manage stakeholders at all levels, resolving differences and achieving clear outcomes.\n\nProcess Compliance:\n\n• Ensure process compliance, documentation, and knowledge management.\n\nSuccessful Profile:\n\n• Proven track record in successful analytics project delivery\n• Preferred domain experience in product and sales analytics\n• Excellent presentation skills, engaging audiences from technical to senior business stakeholders\n• Collaborative team player, skilled in complex analysis and solution recommendations\n\nQualifications:\n\n• 8+ years of relevant work experience with analytics project(s)\n• 4 or more years of leading analytics project(s)\n• Champion in SQL, Python, Visualization tools like Tableau, Advanced Analytics techniques and Gen AI preferred, Agentic AI good to have.\n• Deep understanding of one or more solution areas of Sales analytics, Product analytics, Impact measurement, and Automation.\n• Knowledge of advanced analytics, machine learning techniques and Gen AI.\n• Strong project/program management skills, managing multiple work streams.\n• Excellent problem-solving, innovation, and thought leadership skills.\n• Outstanding presentation and communication skills.\n• Adaptability to changing business priorities in a fast-paced environment.\n• Self-driven with a can-do attitude and appetite for rapid career growth.\n• Master’s or equivalent experience in statistics, computer science, engineering, informatics, data science, or related field; additional MBA degree is a plus.\n\nPay:\nThe wage range for this role takes into account the wide range of factors that are considered in making compensation decisions including but not limited to skill sets; experience and training; licensure and certifications; and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Fractal, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range is: $110,000 to $160,000. In addition, for the current performance period, you may be eligible for a discretionary bonus.\n\nBenefits:\nAs a full-time employee of the company or as an hourly employee working more than 30 hours per week, you will be eligible to participate in the health, dental, vision, life insurance, and disability plans in accordance with the plan documents, which may be amended from time to time. You will be eligible for benefits on the first day of employment with the Company.In addition, you are eligible to participate in the Company 401(k) Plan after 30 days of employment, in accordance with the applicable plan terms. The Company provides for 11 paid holidays and 12 weeks of Parental Leave. We also follow a “free time” PTO policy, allowing you the flexibility to take time needed for either sick time or vacation.\n\nFractal provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
    "location": "San Francisco Bay Area",
    "date_posted": "2025-03-27"
  },
  {
    "title": "Data Scientist",
    "company": "Microsoft",
    "description": "Do you enjoy solving problems, looking at problems through a different lens, and working closely with customers to innovate new solutions to complex problems? Do you jump with excitement at the opportunity to identify trends and provide unique business solutions? Do you want to join a team where learning about a new technology or solution is part of our work every day? Then, come join us!\n\nThe Industry Solutions Engineering (ISE) team is a global engineering organization that works directly with customers looking to leverage the latest technologies to address their toughest challenges.\n\nWe work closely with our customers’ engineers to jointly develop code for cloud-based solutions that can accelerate their organization. We work in collaboration with Microsoft product teams, partners, and open-source communities to empower our customers to do more with the cloud. We develop solutions side-by-side with our customers through collaborative innovation to solve their challenges. This work involves the development of broadly applicable, high-impact solution patterns and open-source software assets that contribute to the Microsoft platform.\n\nWe are hiring a Data Scientist to help drive high-impact engineering projects with our customers and their partners, transforming their missions using AI and other cloud-based solutions and services. Data scientists have data management and expertise in developing statistical techniques to analyze data and find patterns. You will be part of a cross-functional team of software engineers, data scientists, technical program managers, and designers who work side-by-side with high-impact and strategic customers and their engineers to build innovative solutions.\n\nAs part of our team, you will thrive in working with a variety of technologies, not just Microsoft technology. You will solve exciting business problems, contribute to open source, and collaborate with Microsoft product teams. Our team prides itself on embracing a growth mindset, inspiring excellence, and encouraging everyone to share their unique viewpoints and be their authentic selves. Join us and help create life-changing innovations that impact billions around the world!\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\n• You will understand where to acquire the data necessary for your project plan and use querying, visualization, and reporting techniques to describe that data. You’ll also explore data for key attributes and collaborate with others to perform data science experiments using established methodologies.\n• You will understand modeling techniques, select the correct tool and approach to complete objectives, and evaluate the output for statistical and business significance. You’ll also analyze model performance and incorporate customer feedback into its evaluation.\n• You will understand the current state of the industry, including current trends, so that you can contribute to thought leadership best practices. You’ll also write efficient code for a specific feature, and develop a working expertise of proper debugging techniques.\n• You will understand each customer’s business goals and learn best practices for identifying growth opportunities. You’ll also examine projects through a customer-oriented focus, and manage customer expectations regarding project progress.\n• You will embody our culture and values.\n\nQualifications\n\nRequired/Minimum Qualifications \n\n• Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field\n\n• OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 1+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results)\n• OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 2+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results)\n• OR equivalent experience.\n\n• 1+ years customer-facing, project-delivery experience, professional services, and/or consulting experience.\n\nOther Requirements\n\n• This position requires verification of citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and/or local government agency customers and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport.\n\nAdditional Or Preferred Qualifications\n\n• Doctorate in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 1+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results)\n\n• OR Master's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 3+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results)\n• OR Bachelor's Degree in Data Science, Mathematics, Statistics, Econometrics, Economics, Operations Research, Computer Science, or related field AND 5+ years data-science experience (e.g., managing structured and unstructured data, applying statistical techniques and reporting results\n• OR equivalent experience.\n\n• Enjoy travel and are comfortable with travel up to 25%\n\nData Science IC3 - The typical base pay range for this role across the U.S. is USD $98,300 - $193,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $127,200 - $208,800 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay \n\nMicrosoft will accept applications for the role until April 20, 2025.\n\n#ISEngineering\n\n#IPS\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
    "location": "United States",
    "date_posted": "2025-04-07"
  }
]